app/controllers/todos_controller.rb

SELECT "todos".* FROM "todos"
---
  def index
      @todo_items = Todo.all

SELECT "todos".* FROM "todos" ORDER BY "todos"."id" DESC LIMIT 1
DELETE FROM "todos" WHERE "todos"."id" = 6
---
  def delete
  	t = Todo.last
  	t.delete

INSERT INTO "todos" ("completed", "created_at", "todo_item", "updated_at") VALUES (?, ?, ?, ?)  [["completed", nil], ["created_at", Wed, 05 Aug 2015 08:02:50 UTC +00:00], ["todo_item", "it me zakir"], ["updated_at", Wed, 05 Aug 2015 08:02:50 UTC +00:00]]
---
 def add
   Todo.create(:todo_item => params[:todo_text])

SELECT "todos".* FROM "todos" WHERE "todos"."id" = 1 LIMIT 1
UPDATE "todos" SET "completed" = 't', "updated_at" = '2015-08-05 07:56:39.709950' WHERE "todos"."id" = 1
---
   def complete
    params[:todos_checkbox].each do |check|
       todo_id = check
       t = Todo.find_by_id(todo_id)
          t.update_attribute(:completed, true)